[
    {
        "arabic": "عَنْ ابْنِ عَبَّاسٍ رَضِيَ اللَّهُ عَنْهُمَا أَنَّ رَسُولَ اللَّهِ صلى الله عليه و سلم قَالَ: ‘إنَّ اللَّهَ تَجَاوَزَ لِي عَنْ أُمَّتِي الْخَطَأَ وَالنِّسْيَانَ وَمَا اسْتُكْرِهُوا عَلَيْهِ’ . حَدِيثٌ حَسَنٌ، رَوَاهُ ابْنُ مَاجَهْ [رقم: 2045]، وَالْبَيْهَقِيّ [‘السنن’ 7 ].",
        "french": "D'après Ibn Abbas (qu'Allah soit satisfait de lui), le Messager d'Allah (que la paix et la bénédiction d'Allah soient sur lui) a dit : En vérité, Allah a pardonné [ou a été indulgent avec] pour moi ma ummah : leurs erreurs, leurs oublis, et ce qu'ils ont été forcés de faire sous la contrainte.Hadeeth hasan rapporté par Ibn Majah, al-Bayhaqee et d'autres."
    },
    {
        "arabic": "عَنْ أَبِي ذَرٍّ جُنْدَبِ بْنِ جُنَادَةَ، وَأَبِي عَبْدِ الرَّحْمَنِ مُعَاذِ بْنِ جَبَلٍ رَضِيَ اللَّهُ عَنْهُمَا، عَنْ رَسُولِ اللَّهِ صلى الله عليه و سلم قَالَ: ‘اتَّقِ اللَّهَ حَيْثُمَا كُنْت، وَأَتْبِعْ السَّيِّئَةَ الْحَسَنَةَ تَمْحُهَا، وَخَالِقْ النَّاسَ بِخُلُقٍ حَسَنٍ’ . رَوَاهُ التِّرْمِذِيُّ [رقم: 1987] وَقَالَ: حَدِيثٌ حَسَنٌ، وَفِي بَعْضِ النُّسَخِ: حَسَنٌ صَحِيحٌ.",
        "french": "D'après Abu Dharr Jundub ibn Junadah et Abu Abdur-Rahman Muadh bin Jabal (qu'Allah soit satisfait de lui), le Messager d'Allah (que la paix et les bénédictions d'Allah soient sur lui) a dit : « Ayez la taqwa (crainte d'Allah) où que vous soyez, et faites suivre une mauvaise action d'une bonne action qui l'effacera, et comportez-vous bien avec les gens. Il a été rapporté par at-Tirmidhi, qui a dit qu'il s'agissait d'un hadith hasan (bon), et dans certaines copies, il est indiqué qu'il s'agit d'un hadith hasan saheeh."
    },
    {
        "arabic": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللهُ عَنْهُ أَنَّ رَجُلًا قَالَ لِلنَّبِيِّ صلى الله عليه و سلم أَوْصِنِي. قَالَ: لَا تَغْضَبْ، فَرَدَّدَ مِرَارًا، قَالَ: لَا تَغْضَبْ .[رَوَاهُ الْبُخَارِيُّ].",
        "french": "D'après Abou Hourayra (qu'Allah soit satisfait de lui) : Un homme dit au Prophète (paix et bénédictions d'Allah soient sur lui) : « Conseille-moi “, alors il (paix et bénédictions d'Allah soient sur lui) dit : ” Ne te mets pas en colère ». L'homme répéta [sa demande de conseil] plusieurs fois, et [à chaque fois] le Prophète (paix et bénédictions d'Allah soient sur lui) dit : « Ne te mets pas en colère.» [Al-Bukhari]"
    },
    {
        "arabic": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللهُ عَنْهُ أَنَّ رَسُولَ اللَّهِ صلى الله عليه و سلم قَالَ: ‘مَنْ كَانَ يُؤْمِنُ بِاَللَّهِ وَالْيَوْمِ الْآخِرِ فَلْيَقُلْ خَيْرًا أَوْ لِيَصْمُتْ، وَمَنْ كَانَ يُؤْمِنُ بِاَللَّهِ وَالْيَوْمِ الْآخِرِ فَلْيُكْرِمْ جَارَهُ، وَمَنْ كَانَ يُؤْمِنُ بِاَللَّهِ وَالْيَوْمِ الْآخِرِ فَلْيُكْرِمْ ضَيْفَهُ’.[رَوَاهُ الْبُخَارِيُّ] ، [وَمُسْلِمٌ]",
        "french": "D'après Abu Hurayrah (qu'Allah soit satisfait de lui), le Messager d'Allah (que la paix et les bénédictions d'Allah soient sur lui) a dit : « Que celui qui croit en Allah et au Jour dernier dise du bien ou se taise ; que celui qui croit en Allah et au Jour dernier soit généreux envers son voisin ; et que celui qui croit en Allah et au Jour dernier soit généreux envers son invité. [Al-Bukhari] [Muslim]"
    },
    {
        "arabic": "عَنْ أَبِي حَمْزَةَ أَنَسِ بْنِ مَالِكٍ رَضِيَ اللهُ عَنْهُ خَادِمِ رَسُولِ اللَّهِ صلى الله عليه و سلم عَنْ النَّبِيِّ صلى الله عليه و سلم قَالَ: ‘لَا يُؤْمِنُ أَحَدُكُمْ حَتَّى يُحِبَّ لِأَخِيهِ مَا يُحِبُّ لِنَفْسِهِ’. رَوَاهُ الْبُخَارِيُّ [رقم: 13]، وَمُسْلِمٌ [رقم: 45]. [رَوَاهُ الْبُخَارِيُّ] ، [وَمُسْلِمٌ]",
        "french": "D'après Abu Hamzah Anas bin Malik (qu'Allah soit satisfait de lui) - le serviteur du Messager d'Allah (que la paix et les bénédictions d'Allah soient sur lui) - le Prophète (que la paix et les bénédictions d'Allah soient sur lui) a dit : « Aucun d'entre vous ne croit tant qu'il n'aime pas pour son frère ce qu'il aime pour lui-même : Aucun d'entre vous ne croit tant qu'il n'aime pas pour son frère ce qu'il aime pour lui-même. [Al-Bukhari] [Muslim]"
    },
    {
        "arabic": "عَنْ أَبِي هُرَيْرَةَ رَضِيَ اللهُ عَنْهُ قَالَ: قَالَ رَسُولُ اللَّهِ صلى الله عليه و سلم 'مِنْ حُسْنِ إسْلَامِ الْمَرْءِ تَرْكُهُ مَا لَا يَعْنِيهِ’. حَدِيثٌ حَسَنٌ، رَوَاهُ التِّرْمِذِيُّ [رقم: 2318] ، ابن ماجه [رقم: 3976].",
        "french": "D'après Abu Hurayrah (qu'Allah soit satisfait de lui) qui a dit : « Le Messager d'Allah (que la paix et les bénédictions d'Allah soient sur lui) a dit : « Une partie de la perfection de l'Islam d'une personne est qu'elle abandonne ce qui ne la concerne pas. » Un hadith hasan (bon) qui a été rapporté par at-Tirmidhi et d'autres de cette manière."
    },
    {
        "arabic": "عَنْ أَبِي هُرَيْرَةَ عَبْدِ الرَّحْمَنِ بْنِ صَخْرٍ رَضِيَ اللهُ عَنْهُ قَالَ: سَمِعْت رَسُولَ اللَّهِ صلى الله عليه و سلم يَقُولُ: ‘مَا نَهَيْتُكُمْ عَنْهُ فَاجْتَنِبُوهُ، وَمَا أَمَرْتُكُمْ بِهِ فَأْتُوا مِنْهُ مَا اسْتَطَعْتُمْ، فَإِنَّمَا أَهْلَكَ الَّذِينَ مِنْ قَبْلِكُمْ كَثْرَةُ مَسَائِلِهِمْ وَاخْتِلَافُهُمْ عَلَى أَنْبِيَائِهِمْ ‘. [رَوَاهُ الْبُخَارِيُّ] ،[وَمُسْلِمٌ]",
        "french": "D'après Abu Hurayrah (ra) : J'ai entendu le Messager d'Allah (ﷺ) dire : « Ce que je vous ai interdit, évitez-le. Ce que je vous ai ordonné, faites-le autant que vous le pouvez. Car, en vérité, ce ne sont que les interrogations excessives et leur désaccord avec leurs prophètes qui ont détruit [les nations] qui étaient avant vous. » [Bukhari et Muslim]"
    },
    {
        "arabic": "عَنْ أُمِّ الْمُؤْمِنِينَ أُمِّ عَبْدِ اللَّهِ عَائِشَةَ رَضِيَ اللَّهُ عَنْهَا، قَالَتْ: قَالَ: رَسُولُ اللَّهِ صلى الله عليه و سلم 'مَنْ أَحْدَثَ فِي أَمْرِنَا هَذَا مَا لَيْسَ مِنْهُ فَهُوَ رَدٌّ [رَوَاهُ الْبُخَارِيُّ] ،[وَمُسْلِمٌ] وَفِي رِوَايَةٍ لِمُسْلِمٍ: مَنْ عَمِلَ عَمَلًا لَيْسَ عَلَيْهِ أَمْرُنَا فَهُوَ رَدٌّ'.",
        "french": "D'après la mère des croyants, Aïcha (ra), qui a dit : Le Messager d'Allah (ﷺ) a dit : « Celui qui innove quelque chose dans cette affaire qui est la nôtre (c'est-à-dire l'Islam) et qui n'en fait pas partie, la verra rejetée. [Bukhari & Muslim] Dans une autre version de Muslim, on lit : Celui qui accomplit un acte que nous n'avons pas ordonné le verra rejeté (par Allah) » [Bukhari & Muslim]."
    },
    {
        "arabic": "عَنْ أَبِي عَبْدِ الرَّحْمَنِ عَبْدِ اللَّهِ بْنِ عُمَرَ بْنِ الْخَطَّابِ رَضِيَ اللَّهُ عَنْهُمَا قَالَ: سَمِعْت رَسُولَ اللَّهِ صلى الله عليه و سلم يَقُولُ': بُنِيَ الْإِسْلَامُ عَلَى خَمْسٍ: شَهَادَةِ أَنْ لَا إلَهَ إلَّا اللَّهُ وَأَنَّ مُحَمَّدًا رَسُولُ اللَّهِ، وَإِقَامِ الصَّلَاةِ، وَإِيتَاءِ الزَّكَاةِ، وَحَجِّ الْبَيْتِ، وَصَوْمِ رَمَضَانَ'. [رَوَاهُ الْبُخَارِيُّ] ، [وَمُسْلِمٌ].",
        "french": "Sur l'autorité d'Abdullah, fils d'Umar ibn al-Khattab (ra), qui a dit : J'ai entendu le Messager d'Allah (ﷺ) dire : « L'islam a été construit sur cinq [piliers] : attester qu'il n'y a pas d'autre divinité digne d'être adorée qu'Allah et que Muhammad est le Messager d'Allah, établir la salah (prière), payer la zakat (charité obligatoire), faire le hajj (pèlerinage) à la Mecque, et jeûner pendant le Ramadhan. [Bukhari & Muslim]"
    },
    {
        "arabic": "عَنْ أَنَسِ بْنِ مَالِكٍ رَضِيَ اللهُ عَنْهُ قَالَ: سَمِعْت رَسُولَ اللَّهِ صلى الله عليه و سلم يَقُولُ: قَالَ اللَّهُ تَعَالَى: 'يَا ابْنَ آدَمَ! إِنَّكَ مَا دَعَوْتنِي وَرَجَوْتنِي غَفَرْتُ لَك عَلَى مَا كَانَ مِنْك وَلَا أُبَالِي، يَا ابْنَ آدَمَ! لَوْ بَلَغَتْ ذُنُوبُك عَنَانَ السَّمَاءِ ثُمَّ اسْتَغْفَرْتنِي غَفَرْتُ لَك، يَا ابْنَ آدَمَ! إنَّك لَوْ أتَيْتنِي بِقُرَابِ الْأَرْضِ خَطَايَا ثُمَّ لَقِيتنِي لَا تُشْرِكُ بِي شَيْئًا لَأَتَيْتُك بِقُرَابِهَا مَغْفِرَة’ . رَوَاهُ التِّرْمِذِيُّ [رقم: 3540]، وَقَالَ: حَدِيثٌ حَسَنٌ صَحِيحٌ.",
        "french": "D'après Anas (qu'Allah soit satisfait de lui) qui a dit : J'ai entendu le Messager d'Allah (que la paix et la bénédiction d'Allah soient sur lui) dire : « Allah le Tout-Puissant a dit : 'Ô fils d'Adam, tant que vous m'invoquerez et que vous me demanderez pardon, je vous pardonnerai ce que vous avez fait, et je ne vous en voudrai pas. Ô fils d'Adam, si tes péchés atteignaient les nuages du ciel et que tu me demandais pardon, je te pardonnerais. Ô Fils d'Adam, si tu venais à Moi avec des péchés presque aussi grands que la Terre, et si tu me faisais face, sans m'associer, Je t'apporterais un pardon presque aussi grand qu'elle.» Cela a été rapporté par at-Tirmidhi, qui a dit qu'il s'agissait d'un hadith hasan."
    }
]